Revit 2027 API
TableSectionData.RemoveColumn Method
 Removes a column data at a specified index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveColumn(
	int nIndex
)
Public Sub RemoveColumn (
	nIndex As Integer
)
public:
void RemoveColumn(
	int nIndex
)
member RemoveColumn :
        nIndex : int -> unit
Parameters
nIndex Int32
 An integer index
Exceptions
Exception | Condition
ArgumentException |  nIndex is invalid index.
InvalidOperationException |  This operation is forbidden for cells in standard schedule body sections.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace